       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL-APP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "../LIST-IN.DAT".
           SELECT OUTFILE ASSIGN TO "../LIST-OUT.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MLIST-REC.
       01  MLIST-REC.
           02 STUDENT-NAME PIC X(25).
           02 STUDENT-GENDER PIC X.
       FD  OUTFILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01  HDG-1.
           02 FILLER PIC X(28) VALUE SPACES.
           02 FILLER PIC X(15) VALUE "MASTERLIST LIST".
           02 FILLER PIC X(28) VALUE SPACES.
       01  HDG-2.
           02 FILLER PIC X(36) VALUE SPACES.
           02 FILLER PIC X(8) VALUE "BSIT 2-1".
           02 FILLER PIC X(36) VALUE SPACES.
       01  HDG-3.
           02 FILLER PIC X(10) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "STUDENT".
           02 FILLER PIC X(25) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "GENDER".
           02 FILLER PIC X(34) VALUE SPACES.
       01  GENDER-LINE.
           02 FILLER PIC X(10) VALUE SPACE.
           02 FILLER PIC X(14) VALUE " NO OF MALES: ".
           02 I PIC 99 VALUE ZERO.
           02 FILLER PIC X(10) VALUE SPACE.
           02 FILLER PIC X(16) VALUE " NO OF FEMALES: ".
           02 J PIC 99 VALUE ZERO.
       01  PRINT-LINE.
           02 FILLER PIC X(15) VALUE SPACE.
           02 NAME-OUT PIC X(25).
           02 FILLER PIC X(15) VALUE SPACE.
           02 GENDER-OUT PIC X.
       01  E-O-F PIC XXX VALUE "NO".
       PROCEDURE DIVISION.
           OPEN INPUT INFILE
                OUTPUT OUTFILE.
           WRITE PRINT-REC FROM HDG-1 AFTER 1 LINE.
           WRITE PRINT-REC FROM HDG-2 AFTER 2 LINES.
           MOVE SPACES TO PRINT-REC.
           WRITE PRINT-REC AFTER 1 LINE.
           WRITE PRINT-REC FROM HDG-3 AFTER 3 LINE.
           READ INFILE AT END MOVE "YES" TO E-O-F.


           PERFORM READ-RTN UNTIL E-O-F = "YES".
           PERFORM DISPLAY-RTN.
           PERFORM CLOSE-RTN.

       READ-RTN.
           MOVE STUDENT-NAME TO NAME-OUT.
           IF (STUDENT-GENDER = "M")
                ADD 1 TO I
           ELSE IF (STUDENT-GENDER = "F")
                ADD 1 TO J.
           MOVE STUDENT-GENDER TO GENDER-OUT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER 1 LINE.
           READ INFILE AT END MOVE "YES" TO E-O-F.

       DISPLAY-RTN.
           WRITE PRINT-REC FROM GENDER-LINE AFTER 1 LINE.
       CLOSE-RTN.
           CLOSE INFILE, OUTFILE.
           STOP RUN.
